Keywords = ['зона', 'менты', 'ауе', 'сосать', 'сосет', 'поебень', 'ебень', 'пиздеж', 'сука', 'говно', 'залупа', 'пенис', 'хер', 'давалка', 'хуй', 'блядина', 'головка', 'шлюха', 'жопа', 'член', 'еблан', 'петух', 'мудила', 'рукоблуд', 'ссанина', 'очко', 'блядун', 'вагина', 'сука', 'ебланище', 'влагалище', 'пердун', 'дрочила', 'пидор', 'пизда', 'гомик', 'мудила', 'пилотка', 'манда', 'анус', 'путана', 'педрила', 'шалава', 'хуила', 'мошонка', 'елда', 'пиздец', 'нахуй', 'нахуя', 'шароебиться',
'блять', 'бля', 'блядь', 'пиздострадать', 'мразота', 'ахуенно', 'хуй', 'ебануться', 'блядская', 'пиздато', 'ебать', 'трахать', 'секс', 'отпизжу', 'пиздить', 'разъебу', 'уебище', 'хуево', 'бля', 'ахуеешь', 'ебануться', 'заебашу', 'заебала', 'нихуя', 'наблядовать', 'заебись', 'пиздопроебина', 'выпездреныш', 'пиздабол', 'похуй', 'похуист', 'хуета', 'гавно', 'залупа', 'шалава', 'шлюха', 'член', 'влагалище', 'клитор', 'пердун', 'ебанат', 'богохуйство', 'хрен', 'fuck', 'bitch', 'shit']


def analyze(text: str):
    text = text.lower()
    for keyword in Keywords:
        if keyword in text:
            return False
    return True


if __name__ == "__main__":
    pass
